Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute
Optional attribute for use with an AddInPlugin derived class.
If this attribute is not used, the default location for an AddInPlugin is AddInLocation.AddIn

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.#ctor(Autodesk.Navisworks.Api.Plugins.AddInLocation)
Constructor AddInPluginAttribute, takes a single parameter giving the location of the Plugin in the Navisworks menus system

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.CallCanExecute
Determines the conditions in which CanExecuteCommand should be called.

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.CanToggle
Specifies if the command can toggle

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.Icon
The 16x16 icon to display for this command

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.LargeIcon
The 32x32 icon to display for this command

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.LoadForCanExecute
Specifies if CanExecuteCommand should cause the Plugin to load

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.Location
Determines where the plugin is displayed in Navisworks menus system

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.Shortcut
Specifies the keyboard shortcut for the command.

Autodesk.Navisworks.Api.Plugins.AddInPluginAttribute.ShortcutWindowTypes
The Ids of the windows for which the shortcut is valid.
Multiple Ids can be specified by separating with ";".
If Ids are specified the shortcut should be valid in all contexts.